#                           hello! world!                               
########################################################################
#--------> File Name:learn_bash_4.sh
#--------> Version: 1.0
#--------> Author: peranda
#--------> Mail: 1365227825@qq.com
#--------> Created Time:2018-08-11 15:39:44
########################################################################
#!/bin/bash

echo $0
echo "第１个参数" $1
echo "第２个参数" $2
echo "第３个参数" $3
echo "第５个参数" $5
echo "参数的总个数" $#
echo "全部参数之参数视为一个字符串" "$*"
echo "全部参数之参数视为不同串" "$@"
