#                           hello! world!                               
########################################################################
#--------> File Name:learn_bash_1.sh
#--------> Version: 1.0
#--------> Author: peranda
#--------> Mail: 1365227825@qq.com
#--------> Created Time:2018-08-11 15:07:13
########################################################################
#!/bin/bash

echo "当前的shell脚本的文件名字"　$0

echo "你输入过的数字："

echo "第１个参数" $1
echo "第２个参数" $2
echo "第３个参数" $3
echo "第６个参数" $6
