#                           hello! world!                               
########################################################################
#--------> File Name:delete_file.sh
#--------> Version: 1.0
#--------> Author: peranda
#--------> Mail: 1365227825@qq.com
#--------> Created Time:2018-08-13 21:54:19
########################################################################
#!/bin/bash

#删除文件的操作
    echo -e "\033[1;31m警告！您正在的进行回收站清空操作！！\033[0m"
    echo -e "\033[1;31m您确定要执行此操作吗？[y/n]\033[0m"
    read key
    if [ $key == 'y' -o $key == 'Y'  ]; then 
        /bin/rm -rf ~/.My_Pail/*
        echo -e "\033[1;34m您的清空操作执行成功！\033[0m"
    else 
        echo -e "\033[1;31m您的清空操作失败！请检查是否出现问题！\033[0m" 
    fi
    # if [[ $? -eq 0  ]]; then
    #     echo -e "\033[1;34m您的清空操作执行成功！\033[0m"
    # else
    #     echo -e "\033[1;31m您的清空操作失败！请检查是否出现问题！\033[0m"
    # fi

