#                           hello! world!                               
########################################################################
#--------> File Name:found_file.sh
#--------> Version: 1.0
#--------> Author: peranda
#--------> Mail: 1365227825@qq.com
#--------> Created Time:2018-08-13 21:53:16
########################################################################
#!/bin/bash


#找回文件的操作
    # rf mame* 因为找回的文件名字自带时间
    mv -i ~/.My_Pail/$@ ./ 
    if [[ $? -eq 0  ]]; then
        echo -e "\033[1;34m您已经将文件"$@"找回至\033[0m"; pwd
    else 
        echo -e "\033[1;31m您的文件找回操作失败！\033[0m" 
    fi 
