#                           hello! world!                               
########################################################################
#--------> File Name:move_file.sh
#--------> Version: 1.0
#--------> Author: peranda
#--------> Mail: 1365227825@qq.com
#--------> Created Time:2018-08-13 21:47:53
########################################################################
#!/bin/bash


#移动文件的操作
    if [[ "$1" == "-f"   ]]; then #rm -r name
        echo -e "\033[1;34m执行了rm -f操作！\033[0m"
        if [[ -d $2   ]]; then
            mv $2 ~/.My_Pail/$2 
            #不增加时间在结尾是因为如果是目录最好不要添加东西
        else 
            mv $2 ~/.My_Pail/${2}.`date +%Y%m%d-%H:%M:%S`
            #文件则在末尾日期，因为删除文件比较频繁，以免出现重名
        fi 
        echo -e "\033[1;34m已经将"$@"放入回收站\033[0m" 
        　
    elif [[ "$1" == "-r" && "$2" == "-f"   ]]; then 
        　 
        echo -e "\033[1;34m执行了rm -r -f操作！\033[0m"
        mv $3 ~/.My_Pail/$3 

        #只需要移动这个目录或者文件　因为在其他地方文件末尾是有日期的
        #不怕重名


    else  
        echo -e "\033[1;34m正在进行将"$@"放入回收站的操作！\033[0m"
        #rm name 实现删除（移动）功能
        mv $@ ~/.My_Pail/$@.`date +%Y%m%d-%H:%M:%S`

        if [[ $? -eq 0   ]]; then
            echo -e "\033[1;34m已经将"$@"放入回收站！\033[0m"
        else 
            echo -e "\033[1;31m您的回收操作失败了！\033[0m"
        fi
        #设置时间是为了预防多次移动的文件出现重名
        #并且能直观的分辨文件的移动时间
    fi


