#                           hello! world!                               
########################################################################
#--------> File Name:mem.sh
#--------> Version: 2.0
#--------> Author: Peranda
#--------> Mail: 
#--------> Created Time:2018-08-24 16:28:05
########################################################################
#!/bin/bash 
echo "输出项:时间,总内存,剩余内存,当前占用（％）,占用百分比动态平均值 "
echo -n "`date +%Y%m%d_%H:%M:%S` "
ans=`free -m | grep "^Mem:" | awk -v s="%" '{printf " %d, %d, %.2f%s", $2,  $2-$3,  $3/$2*100,s }' `
echo -n "$ans  "
ans=${1},${ans}
echo $ans | awk -v s="%" 'BEGIN{FS=","} {printf " %.2f%s\n", $1 * 0.3 + 0.7 * $4 ,s}'


